#+TITLE: Awk
#+PROPERTY: header-args

Awk is a text manipulation tool that allows us to grab certain columns from text. Lets
run ~ps~ for example and see what output we get:
#+BEGIN_SRC sh :results output
  ps -t pts/0
#+END_SRC

:     PID TTY          TIME CMD
:    5675 pts/0    00:00:00 fish
:    6298 pts/0    00:00:00 emacs

Now lets pipe that same command into ~awk~ and see if we can grab just the first column:
#+begin_src sh :results output
  ps -t pts/0 | awk '{print $1}'
#+end_src

: PID
: 5675
: 6298

If we needed to grab the second column we can do the following:
#+begin_src sh :results output
  ps -t pts/0 | awk '{print $2}'
#+end_src

: TTY
: pts/0
: pts/0

If we needed to grab multiple columns we can of course specify more than one:
#+begin_src sh :results output
  ps -t pts/0 | awk '{print $1 $4}'
#+end_src

: PIDCMD
: 5675fish
: 6298emacs
We will cover how to make this look better in the separators section of this chapter.

If it is worth noting ~$0~ will print the full output:
#+begin_src sh :results output
  ps -t pts/0 | awk '{print $0}'
  # We can also achieve this with: awk '{print}'
#+end_src

:     PID TTY          TIME CMD
:    5675 pts/0    00:00:00 fish
:    6298 pts/0    00:00:00 emacs

* String parsing
  For our next challenge lets say we wanted to know each of the shells installed on our
  system. We can just view whats in ~/etc/shells~:
  #+begin_src sh :results output
    cat /etc/shells
  #+end_src

  : # Pathnames of valid login shells.
  : # See shells(5) for details.
  : 
  : /bin/sh
  : /bin/bash
  : /usr/bin/git-shell
  : /usr/bin/fish
  : /bin/fish

  This will work but what if we wanted just the name of the shells themselves. With
  ~awk~ we can print just the last column of our supplied text with ~$NF~:
  #+begin_src sh :results output
    awk -F "/" '{print $NF}' /etc/shells
  #+end_src

  : # Pathnames of valid login shells.
  : # See shells(5) for details.
  : 
  : sh
  : bash
  : git-shell
  : fish
  : fish

  This is almost what we wanted but you will see that the first few lines of the shells
  file also stuck around since it didn't use our ~/~ separator. Lets talk about how we
  can tell ~awk~ exactly what kind of text we want to look for from our file. Inside of
  our single quotes in our awk command we can do more than just specify what we want to
  print. In fact anything inside our single quotes is actually our ~awk~ script if you
  want to think about it that way. Earlier in the separators section you saw that we
  told ~awk~ what we wanted our input and output field separators to be; this was
  done inside the single quotes of our ~awk~ command. Now lets tell ~awk~ what type of
  line we want to grab for our shells file. We can specify any search pattern we want to
  look for inside of ~/ /~:
  #+begin_src sh :results output
    # awk uses regex inside of the '/ /' to define what it is searching for.
    # For more information on regex see my regex guide.
    awk -F "/" '/^\// {print $NF}' /etc/shells
  #+end_src

  : sh
  : bash
  : git-shell
  : fish
  : fish

  We used regex to define that we only wanted to look for lines that started with a ~/~.
  Now lets just pipe the output of our ~awk~ command into ~uniq~ to remove the duplicate
  shells, and lets pipe that into ~sort~ so they are sorted alphabetically:
  #+begin_src sh :results example
    awk -F "/" '/^\// {print $NF}' /etc/shells | uniq | sort
  #+end_src

  : bash
  : fish
  : git-shell
  : sh

  This time lets search our bashrc for any lines starting a =b= or a =c=:
  #+begin_src sh :results output
    awk '$1 ~ /^[b,c]/ {print $0}' ~/.bashrc
  #+end_src

  #+RESULTS:
  : case $- in
  : case "$TERM" in
  : 	color_prompt=yes
  : 	color_prompt=
  : case "$TERM" in

* Line numbers
  A feature of ~awk~ worth noting is the line number specifier. Say we had a big block
  of output from a command and we only wanted to see a specific line number of the
  output, or even a specific range of line numbers. Lets try this on the ~df~ command:
  #+begin_src sh :results output
    df | awk 'NR==7, NR==11 {print NR, $0}'
  #+end_src

  : 7 /dev/loop0        225280   225280         0 100% /var/lib/snapd/snap/multipass/4458
  : 8 /dev/loop2         33152    33152         0 100% /var/lib/snapd/snap/snapd/12159
  : 9 /dev/loop3        225280   225280         0 100% /var/lib/snapd/snap/multipass/4861
  : 10 /dev/loop5         56832    56832         0 100% /var/lib/snapd/snap/core18/2066
  : 11 /dev/loop4         56832    56832         0 100% /var/lib/snapd/snap/core18/2074

  ~NR~ is what we use in ~awk~ to signify line number. Above you can see we were able to
  grab lines 7-11 using ~NR~ and print both the line number and the line itself. Of
  course if we didn't want to print the line number we could just drop ~NR~ from our
  print statement:
  #+begin_src sh :results output
    df | awk 'NR==7, NR==11 {print $0}'
  #+end_src

  : /dev/loop0        225280   225280         0 100% /var/lib/snapd/snap/multipass/4458
  : /dev/loop2         33152    33152         0 100% /var/lib/snapd/snap/snapd/12159
  : /dev/loop3        225280   225280         0 100% /var/lib/snapd/snap/multipass/4861
  : /dev/loop5         56832    56832         0 100% /var/lib/snapd/snap/core18/2066
  : /dev/loop4         56832    56832         0 100% /var/lib/snapd/snap/core18/2074

  We can also use ~NR~ to get a line count of a file, lets pick on =/etc/shells= again:
  #+NAME: LineCount
  #+begin_src sh :results output :exports both
    awk 'END {print NR}' /etc/shells
  #+end_src

  #+RESULTS: LineCount
  : 8

  We can also use the line number feature of ~awk~ to replace the linux tool ~head~:
  #+NAME: Head
  #+begin_src sh :results output :exports both
    awk 'NR < 13' /etc/shells
  #+end_src

  #+RESULTS: Head
  : # Pathnames of valid login shells.
  : # See shells(5) for details.
  : 
  : /bin/sh
  : /bin/bash
  : /usr/bin/git-shell
  : /usr/bin/fish
  : /bin/fish

  We can see that we grabbed the first 13 lines of our shells file.
